api/app/controllers/api/districts_controller.rb

  def show
    render json: District.find(params[:id])
---
SELECT  "districts".* FROM "districts" WHERE "districts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]