api/app/controllers/api/schools_controller.rb

SELECT "schools".* FROM "schools"
---
  def index
    render json: School.all.to_json(only: [:id, :name])

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    render json: School.find(params[:id])