api/app/controllers/api/schools_controller.rb

SELECT "schools".* FROM "schools" WHERE "schools"."district_id" = $1 ORDER BY "schools"."name" ASC  [["district_id", 1]]
---
  def index
    render json: School.where(district_id: params[:district_id]).order(:name).to_json(only: [:id, :name, :grade_level])