app/controllers/api/users_controller.rb

  def create
    user = User.new(create_params)

    if user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Test User"], ["created_at", "2019-09-03 01:12:05.910513"], ["updated_at", "2019-09-03 01:12:05.910513"]]

  def avatar
    user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]